app/Http/Middleware/HandleInertiaRequests.php

select * from `doctors` where `doctors`.`user_id` = 1 and `doctors`.`user_id` is not null limit 1
---
    public function share(Request $request): array
    {
        $clientTimezone = session('timeZone');
        return array_merge(parent::share($request), [
            'logo'=>asset('web/assets/img/logo.png'),
            'auth' => Auth::user(),
            'super_admin' => Auth::user() && Auth::user()->hasRole('super'),
            'doctor' => Auth::user() && Auth::user()->hasRole('doctor'),
            'admin' => Auth::user() && Auth::user()->hasRole('admin'),
            'authPermissions' => Auth::user() ? Auth::user()->permissions()->pluck('name')->toArray() : [],
            'doctorObject' => Auth::check() ? Auth::user()->doctor()->first() ?? [] : [],