app/Http/Middleware/UserActivity.php

    public function handle(Request $request, Closure $next): Response
    {
        if (Auth::check()) {
            $expiresAt = now()->addMinutes(2);
            Cache::put('user-is-online-' . Auth::user()->id, true, $expiresAt);
            User::where('id', Auth::user()->id)->update(['last_seen' => now()]);
---
update `users` set `last_seen` = '2024-03-20 02:48:15', `users`.`updated_at` = '2024-03-20 02:48:15' where `id` = 1