app/Http/Controllers/Admin/AppointmentController.php

    public function index(Request $request): Response
    {
        return Inertia::render('Admin/Appointments/AppointmentIndex', [
            'appointments' => Appointment::query()
                ->when($request->input('search'), function ($query, $search) {
                    $query->where('id', 'like', '%' . $search . '%')
                        ->orWhere('amount', 'like', '%' . $search . '%')
                        ->orWhere('appointment_date', 'like', '%' . $search . '%')
                        ->orWhere('appointment_time', 'like', '%' . $search . '%')
                        ->orWhere('day', 'like', '%' . $search . '%')
                        ->orWhere('status', 'like', '%' . $search . '%')
                        ->orWhereHas('patient.user', function ($query) use ($search) {
                            $query->where('name', 'like', '%' . $search . '%');
                        })
                        ->orWhereHas('doctor.user', function ($query) use ($search) {
                            $query->where('name', 'like', '%' . $search . '%');
                        });
                })
                ->with(['patient.user', 'doctor.user'])
                ->orderBy('id', 'desc')
                ->paginate(8)
                ->withQueryString(),
            'filters' => $request->only(['search'])
        ]);
---
select count(*) as aggregate from `appointments`