app/Http/Controllers/Admin/AppUserController.php

    public function index(): Response
    {
        return Inertia::render('Admin/AppUsers/AppUsersIndex', [
            'users' => User::whereIn('user_type', ['admin'])->get()->toArray(),
            'permissions' => Permission::all()->toArray()
        ]);
---
select * from `users` where `user_type` in ('admin')
select * from `permissions`