app/Http/Controllers/Admin/BlogCategoryController.php

select count(*) as aggregate from `blog_categories`
---
    public function index(Request $request): Response
    {
        return Inertia::render('Admin/BlogCategory/BlogCategoryIndex', [
            'blogcategories' => BlogCategory::query()
                ->when($request->input('search'), function ($query, $search) {
                    $query->where('id', 'like', '%' . $search . '%')
                        ->orWhere('category_name', 'like', '%' . $search . '%')
                        ->orWhere('created_at', 'like', '%' . $search . '%')
                        ->orWhere('updated_at', 'like', '%' . $search . '%');
                })
                ->orderBy('id', 'desc')
                ->paginate(8)
                ->withQueryString(),
            'filters' => $request->only(['search'])
        ]);