app/Http/Controllers/Admin/DoctorController.php

    public function index(Request $request): Response
    {
        return Inertia::render('Admin/Doctors/DoctorIndex', [
            'doctors' => Doctor::query()
                ->whereHas('user', function ($query) {
                    $query->where('user_type', 'doctor');
                })
                ->when($request->input('search'), function ($query, $search) {
                    $query->where('id', 'like', '%' . $search . '%')
                        ->orWhere('gender', 'like', '%' . $search . '%')
                        ->orWhere('fee', 'like', '%' . $search . '%')
                        ->orWhere('contact', 'like', '%' . $search . '%')
                        ->orWhereHas('user', function ($query) use ($search) {
                            $query->where('name', 'like', '%' . $search . '%')
                                ->orWhere('email', 'like', '%' . $search . '%');
                        });
                })
                ->with('user')
                ->orderBy('id', 'desc')
                ->paginate(8)
                ->withQueryString(),
            'filters' => $request->only(['search'])
        ]);
---
select count(*) as aggregate from `doctors` where exists (select * from `users` where `doctors`.`user_id` = `users`.`id` and `user_type` = 'doctor')