app/Http/Controllers/Admin/HomeController.php

    public function index(): Response
    {
        return Inertia::render('Home/AdminDashboardHome', [
            'doctors' => Doctor::count(),
            'patients' => Patient::count(),
            'appointments' => Appointment::count(),
            'transactions' => Transaction::count(),
        ]);
---
select count(*) as aggregate from `doctors`
select count(*) as aggregate from `patients`
select count(*) as aggregate from `appointments`
select count(*) as aggregate from `transactions`