app/Http/Controllers/Admin/InvoiceController.php

select count(*) as aggregate from `customer_invoices` where `id` like '%%' or `transaction_id` like '%%' or `invoice_number` like '%%' or `invoice_pdf` like '%%' or `total_amount` like '%%'
---
    public function index(Request $request): Response
    {
        $search = $request->input('search');

        return Inertia::render('Admin/Invoices/InvoiceIndex', [
            'invoices' => CustomerInvoice::query()
                ->when($request, function ($query) use ($search) {
                    $query->where('id', 'like', '%' . $search . '%')
                        ->orWhere('transaction_id', 'like', '%' . $search . '%')
                        ->orWhere('invoice_number', 'like', '%' . $search . '%')
                        ->orWhere('invoice_pdf', 'like', '%' . $search . '%')
                        ->orWhere('total_amount', 'like', '%' . $search . '%');
                })
                ->orderBy('id', 'desc')
                ->paginate(8)
                ->withQueryString(),
            'filters' => $request->only(['search'])
        ]);