app/Http/Controllers/Admin/PatientController.php

select count(*) as aggregate from `patients` where exists (select * from `users` where `patients`.`user_id` = `users`.`id` and `user_type` = 'patient') and (`id` like '%%' or `blood_group` like '%%' or `gender` like '%%' or `dob` like '%%' or `contact` like '%%' or `address` like '%%') or exists (select * from `users` where `patients`.`user_id` = `users`.`id` and (`name` like '%%' or `email` like '%%'))
---
    public function index(Request $request): Response
    {
        $search = $request->input('search');

        return Inertia::render('Admin/Patients/PatientIndex', [
            'patients' => Patient::query()
                ->whereHas('user', function ($query) {
                    $query->where('user_type', 'patient');
                })
                ->when($request, function ($query) use ($search) {
                    $query->where(function ($query) use ($search) {
                        $query->where('id', 'like', '%' . $search . '%')
                            ->orWhere('blood_group', 'like', '%' . $search . '%')
                            ->orWhere('gender', 'like', '%' . $search . '%')
                            ->orWhere('dob', 'like', '%' . $search . '%')
                            ->orWhere('contact', 'like', '%' . $search . '%')
                            ->orWhere('address', 'like', '%' . $search . '%');
                    })
                        ->orWhereHas('user', function ($query) use ($search) {
                            $query->where('name', 'like', '%' . $search . '%')
                                ->orWhere('email', 'like', '%' . $search . '%');
                        });
                })
                ->with('user')
                ->orderBy('id', 'desc')
                ->paginate(8)
                ->withQueryString(),