app/Http/Controllers/Admin/TransactionController.php

    public function index(Request $request): Response
    {
        $search = $request->input('search');
        return Inertia::render('Admin/Transactions/TransactionIndex', [
            'transactions' => Transaction::query()
                ->when($request, function ($query) use ($search) {
                    $query->where('id', 'like', '%' . $search . '%')
                        ->orWhere('patient_id', 'like', '%' . $search . '%')
                        ->orWhere('transaction_date', 'like', '%' . $search . '%')
                        ->orWhere('amount', 'like', '%' . $search . '%')
                        ->orWhere('payment_method', 'like', '%' . $search . '%')
                        ->orWhere('card_brand', 'like', '%' . $search . '%');
                })
                ->orderBy('id', 'desc')
                ->paginate(8)
                ->withQueryString(),
            'filters' => $request->only(['search'])
        ]);
---
select count(*) as aggregate from `transactions` where `id` like '%%' or `patient_id` like '%%' or `transaction_date` like '%%' or `amount` like '%%' or `payment_method` like '%%' or `card_brand` like '%%'